CFD/0/U
FoamFile
{
    version               2.0;
    format                ascii;
    class                 volVectorField;
    location              "0";
    object                U;
}


dimensions                [0 1 -1 0 0 0 0];

internalField             uniform   (0 60 0);


boundaryField
{
    front
    {   
        type              fixedValue;
        value             uniform   (0 60 0);
    }
    back                  { type    zeroGradient; }
    right                 { type    zeroGradient; }
    top                   { type    zeroGradient; }
    left                  { type    zeroGradient; }
    bottom                { type    noSlip; }

}