CFD/0/epsilon
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          epsilon;
}
dimensions          [0 2 -3 0 0 0 0];
internalField       uniform 0.09;
boundaryField
{
    front
    {
        type        fixedValue;
        value       uniform 0.09;
    }
    back            { type    zeroGradient; }
    right           { type    zeroGradient; }
    top             { type    zeroGradient; }
    left            { type    zeroGradient; }
    bottom          { type    zeroGradient; }
}
