CFD/0/k
FoamFile
{
    version               2.0;
    format                ascii;
    class                 volScalarField;
    location              "0";
    object                k;
}


dimensions                [0 2 -2 0 0 0 0];

internalField             uniform 0.09;


boundaryField
{
    front
    {
        type              fixedValue; 
        value             uniform 0.09; 
    }
    back                  { type    zeroGradient; }
    right                 { type    zeroGradient; }
    top                   { type    zeroGradient; }
    left                  { type    zeroGradient; }
    bottom                { type    zeroGradient; }
}

